Problem 2:
Use pandas to read the olympic_medals.csv from the DATA folder on Google Drive. Then perform the followings by
using pandas and/or Python built-in functions.
(a) Find the size of the data frame. How many rows, how many columns?
(b) Use the appropriate function to report the data types for all columns.
(c) Find how many unique locations olympics were held at.
(d) Find how many medals the USA team won in total.
(e) Find the total number of medals for each Nationality. (Hint: please search for groupby() function with count)

In [53]:
import csv
import pandas as pd
import collections

with open("/content/drive/MyDrive/DATA/olympic_medals.csv") as f:
    reader = csv.DictReader(f)
    olympics_data = list(reader)

In [57]:
#Problem 2: a)
df = pd.read_csv('/content/drive/MyDrive/DATA/olympic_medals.csv')

#display dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2394 entries, 0 to 2393
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Gender       2394 non-null   object
 1   Event        2394 non-null   object
 2   Location     2394 non-null   object
 3   Year         2394 non-null   int64
 4   Medal        2394 non-null   object
 5   Name         2164 non-null   object
 6   Nationality  2394 non-null   object
 7   Result       2394 non-null   object
dtypes: int64(1), object(7)
memory usage: 149.8+ KB

In [58]:
#display number of rows & columns (rows, columns)
df.shape

(2394, 8)

In [56]:
#b)
#show datatypes for all columns
dataTypes = df.dtypes
print(dataTypes)

Gender         object
Event          object
Location       object
Year            int64
Medal          object
Name           object
Nationality    object
Result         object
dtype: object

In [16]:
#c)
#count unique locations in column 'Location'
uniqueLocations = df['Location'].nunique()

#display number of unique locations
print(uniqueLocations)

23

In [38]:
#d)
#total number of medals
print(df['Medal'].count())

2394

In [41]:
#e)
#show medal count by nationality
df.groupby(['Nationality'])['Medal'].count()

Nationality
ALG      9
ARG      4
AUS     57
AUT      4
BAH     12
      ...
URS    131
USA    638
VEN      2
YUG      1
ZAM      1
Name: Medal, Length: 97, dtype: int64

Problem 3:
Use pandas to read the causes_of_death.csv from the DATA folder on Google Drive. Then perform the followings
by using pandas and/or Python built-in functions.
(a) Find the size of the data frame. How many rows, how many columns?
(b) What is the average death count across the country?
(c) What is the total death count for each state. (Hint: please search for groupby() function with sum)
(d) What is the average death count for each state. (Hint: please search for groupby() function with mean)
(e) What is the total death count for males and females in each state. (Hint: groupby() function with sum, but you
will have two attributes/columns for the groupby() )
(f) Drop your rows which have NA in it. Then verify it by using head() to show they are removed. (Hint: dropna())
(g) Create a column called ratio and assign the ratio of death counts to population to fill its values. Then verify it
by using head().
(h) Select only rows where Ten-Year Age Groups Code is equal to 1. Notice that this column has string data type.
(i) Use the selected rows above (you can either assign to another variable or keep using dot(.) operator) to chain
with other functions (groupby, sum, sort_values) to view your data sorted from the highest Crude rate to
the smallest. This will show the infant mortality rate for all states.

In [43]:
with open("/content/drive/MyDrive/DATA/causes_of_death.csv") as g:
    reader = csv.DictReader(g)
    death_data = list(reader)

df1 = pd.read_csv('/content/drive/MyDrive/DATA/causes_of_death.csv')

In [47]:
#Problem 3:
#a)
#display dataframe info
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4115 entries, 0 to 4114
Data columns (total 11 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   State                     4115 non-null   object
 1   State Code                4115 non-null   int64
 2   Ten-Year Age Groups       4115 non-null   object
 3   Ten-Year Age Groups Code  4115 non-null   object
 4   Gender                    4115 non-null   object
 5   Gender Code               4115 non-null   object
 6   Race                      4115 non-null   object
 7   Race Code                 4115 non-null   object
 8   Deaths                    4115 non-null   int64
 9   Population                4040 non-null   float64
 10  Crude Rate                3765 non-null   float64
dtypes: float64(2), int64(2), object(7)
memory usage: 353.8+ KB

In [48]:
#display number of rows & columns (rows, columns)
df1.shape

(4115, 11)

In [49]:
#b)
#display the average death count across the country
df1['Deaths'].mean()

10914.44957472661

In [50]:
#c)
#display total death count by state
df1.groupby(['State'])['Deaths'].sum()

State
Alabama                  860780
Alaska                    63334
Arizona                  838094
Arkansas                 522914
California              4307061
Colorado                 561283
Connecticut              531290
Delaware                 135933
District of Columbia      94073
Florida                 3131111
Georgia                 1259017
Hawaii                   172244
Idaho                    200077
Illinois                1872171
Indiana                 1031634
Iowa                     507247
Kansas                   448828
Kentucky                 752585
Louisiana                755914
Maine                    231756
Maryland                 800510
Massachusetts            987031
Michigan                1599942
Minnesota                702284
Mississippi              526127
Missouri                1008288
Montana                  158429
Nebraska                 277962
Nevada                   345245
New Hampshire            187917
New Jersey              1291554
New Mexico               281598
New York                2741575
North Carolina          1399009
North Dakota             107281
Ohio                    1987276
Oklahoma                 656535
Oregon                   575952
Pennsylvania            2313855
Rhode Island             176266
South Carolina           732571
South Dakota             128599
Tennessee               1066727
Texas                   2969214
Utah                     260479
Vermont                   95300
Virginia                1071163
Washington               865686
West Virginia            386224
Wisconsin                857629
Wyoming                   77386
Name: Deaths, dtype: int64

In [59]:
#d)
#display average death count by state
df1.groupby(['State'])['Deaths'].mean()

State
Alabama                 10626.913580
Alaska                    772.365854
Arizona                  9109.717391
Arkansas                 6455.728395
California              45819.797872
Colorado                 6378.215909
Connecticut              6559.135802
Delaware                 1970.043478
District of Columbia     1447.276923
Florida                 34790.122222
Georgia                 14639.732558
Hawaii                   2266.368421
Idaho                    2778.847222
Illinois                21519.206897
Indiana                 12895.425000
Iowa                     6185.939024
Kansas                   5407.566265
Kentucky                 9902.434211
Louisiana                9107.397590
Maine                    3310.800000
Maryland                 9201.264368
Massachusetts           12185.567901
Michigan                17976.876404
Minnesota                7980.500000
Mississippi              6117.755814
Missouri                11862.211765
Montana                  2200.402778
Nebraska                 3474.525000
Nevada                   4014.476744
New Hampshire            3030.919355
New Jersey              15375.642857
New Mexico               3236.758621
New York                29799.728261
North Carolina          15373.725275
North Dakota             1650.476923
Ohio                    24534.271605
Oklahoma                 7376.797753
Oregon                   6544.909091
Pennsylvania            27221.823529
Rhode Island             2448.138889
South Carolina           9044.086420
South Dakota             1863.753623
Tennessee               13169.469136
Texas                   32991.266667
Utah                     3028.825581
Vermont                  1944.897959
Virginia                12601.917647
Washington               9726.808989
West Virginia            6229.419355
Wisconsin                9745.784091
Wyoming                  1155.014925
Name: Deaths, dtype: float64

In [62]:
#e)
#total death count for males and females by state
df1.groupby(['State', 'Gender'])['Deaths'].sum()

State          Gender
Alabama        Female    430133
               Male      430647
Alaska         Female     27199
               Male       36135
Arizona        Female    396028
                          ...
West Virginia  Male      192560
Wisconsin      Female    436397
               Male      421232
Wyoming        Female     37153
               Male       40233
Name: Deaths, Length: 102, dtype: int64

In [65]:
#f)
#drop rows with NA in it
df1.dropna()
df1.head()

     State  State Code Ten-Year Age Groups  ... Deaths Population Crude Rate
0  Alabama           1            < 1 year  ...     14     3579.0        NaN
1  Alabama           1            < 1 year  ...     24     7443.0      322.5
2  Alabama           1            < 1 year  ...   2093   169339.0     1236.0
3  Alabama           1            < 1 year  ...   2144   347921.0      616.2
4  Alabama           1            < 1 year  ...     33     7366.0      448.0

[5 rows x 11 columns]

In [70]:
#g)
#Create a column called ratio and assign the ratio of death counts to population to fill its values. Then verify it by using head()

df1['Ratio'] = df1['Deaths'] / df1['Population']
df1.head()

     State  State Code Ten-Year Age Groups  ... Population Crude Rate     Ratio
0  Alabama           1            < 1 year  ...     3579.0        NaN  0.003912
1  Alabama           1            < 1 year  ...     7443.0      322.5  0.003225
2  Alabama           1            < 1 year  ...   169339.0     1236.0  0.012360
3  Alabama           1            < 1 year  ...   347921.0      616.2  0.006162
4  Alabama           1            < 1 year  ...     7366.0      448.0  0.004480

[5 rows x 12 columns]

In [ ]:
#h)
#Select only rows where Ten-Year Age Groups Code is equal to 1.
df1.loc[df1['Ten-Year Age Groups Code'] == 1]

In [ ]:
#i)
#Use the selected rows above (you can either assign to another variable or keep using dot(.) operator) 
#to chain with other functions (groupby, sum, sort_values) to view your data sorted from the highest 
#Crude rate to the smallest. This will show the infant mortality rate for all states

df1.sort_values(by='Crude Rate', ascending = False)